<a href="https://colab.research.google.com/github/robsonbfreitas/TrabalhoFinal/blob/main/TrabalhoFinal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
#Importando bibliotecas
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score

In [4]:
df = pd.read_csv('features.csv')
#dftest = pd.read_csv('test.csv')
dftrain = pd.read_csv('train.csv')
df.head()

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (4) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   Store        Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1  2010-02-05        42.31  ...  211.096358         8.106      False
1      1  2010-02-12        38.51  ...  211.242170         8.106       True
2      1  2010-02-19        39.93  ...  211.289143         8.106      False
3      1  2010-02-26        46.63  ...  211.319643         8.106      False
4      1  2010-03-05        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [5]:
dftrain.head(30)

    Store  Dept        Date  Weekly_Sales IsHoliday
0       1     1  2010-02-05      24924.50     False
1       1     1  2010-02-12      46039.49      True
2       1     1  2010-02-19      41595.55     False
3       1     1  2010-02-26      19403.54     False
4       1     1  2010-03-05      21827.90     False
5       1     1  2010-03-12      21043.39     False
6       1     1  2010-03-19      22136.64     False
7       1     1  2010-03-26      26229.21     False
8       1     1  2010-04-02      57258.43     False
9       1     1  2010-04-09      42960.91     False
10      1     1  2010-04-16      17596.96     False
11      1     1  2010-04-23      16145.35     False
12      1     1  2010-04-30      16555.11     False
13      1     1  2010-05-07      17413.94     False
14      1     1  2010-05-14      18926.74     False
15      1     1  2010-05-21      14773.04     False
16      1     1  2010-05-28      15580.43     False
17      1     1  2010-06-04      17558.09     False
18      1     1  2010-06-11      16637.62     False
19      1     1  2010-06-18      16216.27     False
20      1     1  2010-06-25      16328.72     False
21      1     1  2010-07-02      16333.14     False
22      1     1  2010-07-09      17688.76     False
23      1     1  2010-07-16      17150.84     False
24      1     1  2010-07-23      15360.45     False
25      1     1  2010-07-30      15381.82     False
26      1     1  2010-08-06      17508.41     False
27      1     1  2010-08-13      15536.40     False
28      1     1  2010-08-20      15740.13     False
29      1     1  2010-08-27      15793.87     False

In [10]:
dftest.head()

   Store  Dept        Date  IsHoliday
0      1     1  2012-11-02      False
1      1     1  2012-11-09      False
2      1     1  2012-11-16      False
3      1     1  2012-11-23       True
4      1     1  2012-11-30      False

In [22]:
frames = [df, dftrain]
df2 = dftrain.merge(df, on=['Store','Date'], how='left')

In [23]:
df2.head()

   Store  Dept        Date  ...         CPI Unemployment  IsHoliday_y
0      1     1  2010-02-05  ...  211.096358        8.106        False
1      1     1  2010-02-12  ...  211.242170        8.106         True
2      1     1  2010-02-19  ...  211.289143        8.106        False
3      1     1  2010-02-26  ...  211.319643        8.106        False
4      1     1  2010-03-05  ...  211.350143        8.106        False

[5 rows x 15 columns]

In [25]:
df.query('Date == "2010-02-12"').query('Store == 1')

   Store        Date  Temperature  ...        CPI  Unemployment  IsHoliday
1      1  2010-02-12        38.51  ...  211.24217         8.106       True

[1 rows x 12 columns]

In [26]:
dftrain.query('Date == "2010-02-12"').query('Store == 1')

       Store  Dept        Date  Weekly_Sales IsHoliday
1          1     1  2010-02-12      46039.49      True
144        1     2  2010-02-12      44682.74      True
287        1     3  2010-02-12      10887.84      True
430        1     4  2010-02-12      35351.21      True
573        1     5  2010-02-12      29620.81      True
...      ...   ...         ...           ...       ...
9371       1    93  2010-02-12      70202.02      True
9514       1    94  2010-02-12      62329.48      True
9657       1    95  2010-02-12     111390.36      True
9922       1    97  2010-02-12      33874.47      True
10065      1    98  2010-02-12      16309.73      True

[72 rows x 5 columns]

In [27]:
df2.query('Date == "2010-02-12"').query('Store == 1')

       Store  Dept        Date  ...        CPI Unemployment  IsHoliday_y
1          1     1  2010-02-12  ...  211.24217        8.106         True
144        1     2  2010-02-12  ...  211.24217        8.106         True
287        1     3  2010-02-12  ...  211.24217        8.106         True
430        1     4  2010-02-12  ...  211.24217        8.106         True
573        1     5  2010-02-12  ...  211.24217        8.106         True
...      ...   ...         ...  ...        ...          ...          ...
9371       1    93  2010-02-12  ...  211.24217        8.106         True
9514       1    94  2010-02-12  ...  211.24217        8.106         True
9657       1    95  2010-02-12  ...  211.24217        8.106         True
9922       1    97  2010-02-12  ...  211.24217        8.106         True
10065      1    98  2010-02-12  ...  211.24217        8.106         True

[72 rows x 15 columns]

In [30]:
df2.tail(10)

        Store  Dept        Date  ...         CPI Unemployment  IsHoliday_y
309669     32    44  2012-07-20  ...  197.929038        7.872        False
309670     32    44  2012-07-27  ...  197.979214        7.872        False
309671     32    44  2012-08-03  ...  198.029389        7.872        False
309672     32    44  2012-08-10  ...  198.079565        7.872        False
309673     32    44  2012-08-17  ...  198.100106        7.872        False
309674     32    44  2012-08-24  ...  198.098420        7.872        False
309675     32    44  2012-08-31  ...  198.096734        7.872        False
309676     32    44  2012-09-07  ...  198.095048        7.872         True
309677     32    44  2012-09-14  ...  198.126718        7.872        False
309678     32    44  2012-09-21  ...  198.358523        7.872        False

[10 rows x 15 columns]

In [31]:
df3 = df2[['Store','Date','IsHoliday_y', 'Dept', 'Weekly_Sales']]
df3.head()

   Store        Date  IsHoliday_y  Dept  Weekly_Sales
0      1  2010-02-05        False     1      24924.50
1      1  2010-02-12         True     1      46039.49
2      1  2010-02-19        False     1      41595.55
3      1  2010-02-26        False     1      19403.54
4      1  2010-03-05        False     1      21827.90

In [32]:
df3['Date'] = pd.to_datetime(df3['Date'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [33]:
df3.set_index(['Date'], inplace=True)

In [34]:
df3.head()

            Store  IsHoliday_y  Dept  Weekly_Sales
Date
2010-02-05      1        False     1      24924.50
2010-02-12      1         True     1      46039.49
2010-02-19      1        False     1      41595.55
2010-02-26      1        False     1      19403.54
2010-03-05      1        False     1      21827.90

In [ ]:
df3.fillna(0, inplace=True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4327: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

In [35]:
df3.head(100)

            Store  IsHoliday_y  Dept  Weekly_Sales
Date
2010-02-05      1        False     1      24924.50
2010-02-12      1         True     1      46039.49
2010-02-19      1        False     1      41595.55
2010-02-26      1        False     1      19403.54
2010-03-05      1        False     1      21827.90
...           ...          ...   ...           ...
2011-12-02      1        False     1      25293.49
2011-12-09      1        False     1      33305.92
2011-12-16      1        False     1      45773.03
2011-12-23      1        False     1      46788.75
2011-12-30      1         True     1      23350.88

[100 rows x 4 columns]

In [36]:
y = df3[['Weekly_Sales']]
y

            Weekly_Sales
Date
2010-02-05      24924.50
2010-02-12      46039.49
2010-02-19      41595.55
2010-02-26      19403.54
2010-03-05      21827.90
...                  ...
2012-08-24       4533.20
2012-08-31       3767.29
2012-09-07       4152.52
2012-09-14       4394.31
2012-09-21         42.00

[309679 rows x 1 columns]

In [37]:
y = y.iloc[1:]
y.head()

            Weekly_Sales
Date
2010-02-12      46039.49
2010-02-19      41595.55
2010-02-26      19403.54
2010-03-05      21827.90
2010-03-12      21043.39

In [40]:
X = df3[['Store','Dept','IsHoliday_y','Weekly_Sales']].shift(1)
#X = df.shift(1)
X

            Store  Dept IsHoliday_y  Weekly_Sales
Date
2010-02-05    NaN   NaN         NaN           NaN
2010-02-12    1.0   1.0       False      24924.50
2010-02-19    1.0   1.0        True      46039.49
2010-02-26    1.0   1.0       False      41595.55
2010-03-05    1.0   1.0       False      19403.54
...           ...   ...         ...           ...
2012-08-24   32.0  44.0       False       5656.19
2012-08-31   32.0  44.0       False       4533.20
2012-09-07   32.0  44.0       False       3767.29
2012-09-14   32.0  44.0        True       4152.52
2012-09-21   32.0  44.0       False       4394.31

[309679 rows x 4 columns]

In [41]:
X = X.iloc[1:]
X.head()

            Store  Dept IsHoliday_y  Weekly_Sales
Date
2010-02-12    1.0   1.0       False      24924.50
2010-02-19    1.0   1.0        True      46039.49
2010-02-26    1.0   1.0       False      41595.55
2010-03-05    1.0   1.0       False      19403.54
2010-03-12    1.0   1.0       False      21827.90

In [42]:
y.shape, X.shape

((309678, 1), (309678, 4))

In [43]:
X = pd.get_dummies(X)
X.head()

            Store  Dept  Weekly_Sales  IsHoliday_y_False  IsHoliday_y_True
Date
2010-02-12    1.0   1.0      24924.50                  1                 0
2010-02-19    1.0   1.0      46039.49                  0                 1
2010-02-26    1.0   1.0      41595.55                  1                 0
2010-03-05    1.0   1.0      19403.54                  1                 0
2010-03-12    1.0   1.0      21827.90                  1                 0

In [44]:
X.isna().mean()

Store                0.0
Dept                 0.0
Weekly_Sales         0.0
IsHoliday_y_False    0.0
IsHoliday_y_True     0.0
dtype: float64

In [45]:
reg = LinearRegression()
reg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [46]:
X.shape

(309678, 5)

In [47]:
y.shape

(309678, 1)

In [48]:
result = reg.predict(X)

In [49]:
result

array([[24442.72716807],
       [42853.43285033],
       [40187.91205462],
       ...,
       [ 4546.25056734],
       [ 3378.47115995],
       [ 5138.44756918]])

In [51]:
# Utilizando R2 para medir a performance do modelo
r2_score(y, result)

0.8935380866603414